
Процедура Инициализировать(Отчет = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
КонецПроцедуры

Процедура СброситьНастройкиОтборов(Отчет = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
КонецПроцедуры

Функция НовоеЗаменяемоеПоле(ПутьДо, ПутьПосле) Экспорт
КонецФункции

Функция НовыйОбновляемыйВариант(ВариантОтчета) Экспорт
КонецФункции

Процедура ЗаполнитьВариантыОтчетов() Экспорт
КонецПроцедуры

Процедура ОбновитьВариантыОтчетов() Экспорт
КонецПроцедуры

Функция ЗаменяемыеПоля() Экспорт
КонецФункции

Процедура ОбработатьНастройкиОтчета(Данные) Экспорт
КонецПроцедуры
